/**
 * Використовуємо сервіс https://mockapi.io/ для створення бекенду
 */

const BASE_URL = "https://658c0897859b3491d3f5568a.mockapi.io/api/v1/"

/**
 * Read (GET)
 */

/**
 * Create (POST)
 */

/**
 * Update (PUT/PATCH)
 */

/**
 * Delete (DELETE)
 */









/**
 * ЗАДАЧА:
 * 
 * Написати власну бібліотеку за допомогою https://mockapi.io/.
 * На сторінці відображаються згенеровані книги у певному списку.
 * 
 * Користувач має мати можливість користуватись наступним функціоналом:
 * 1. Переглядати список книг;
 * 2. Відкривати форму, вводити дані про книгу і добавляти її список.
 * 3. Видаляти книгу зі списку;
 * 4. Оновлювати закладку в книжці,
 * тобто змінювати в інпуті сторінку, де користувач зупинився при читанні.
 * 
 * Всі дані повинні зберігатись і оброблятись за допомогою сервера.
 * Сторінка повинна працювати за методологією AJAX.
 */