/*
 * Напиши скрипт перевірки підписки користувача до доступу до контенту
 * - Існує три вида підписки: free, pro и vip.
 * - Отримати доступ можуть лише користувачі pro и vip
 */

const sub = "free";

/*
 * Написати скрипт, який перевіряє можливість відкрити чат із користувачами.
 * Для цього користувач повинен бути:
 * - другом
 * - онлайн
 * - без режима "не турбувати"
 */

const isOnline = true;
const isFriend = true;
const isDnd = true;

// const canOpenChat = ;
// console.log("Можно відкрити чат? ", canOpenChat);
